{
  "MajorArcana": [
    {
      "name": "The Fool",
      "upright": "象徵新的開始、無限可能和冒險精神。愚者啟示勇敢追求夢想，不害怕未知，並擁抱生活中的驚喜與挑戰。",
      "reversed": "提醒衝動與缺乏計劃可能帶來危險或失敗。逆位愚者可能象徵不切實際的幻想，需謹慎權衡每一步。"
    },
    {
      "name": "The Magician",
      "upright": "代表掌控與創造力，暗示擁有資源與能力實現目標。這張牌帶來行動力與信心，指引你把想法付諸實行。",
      "reversed": "象徵欺騙或濫用能力。逆位魔術師提醒你檢視自己的動機，避免操縱他人或被他人操縱。"
    },
    {
      "name": "The High Priestess",
      "upright": "象徵直覺、內在智慧與神秘知識。提醒你信任自己的直覺，深入探索潛意識中的答案。",
      "reversed": "可能意味忽略直覺或對真相的抗拒。逆位女祭司提示要注意隱藏的信息，避免陷入困惑。"
    },
    {
      "name": "The Empress",
      "upright": "代表豐饒、創造力與愛。象徵母性的力量、自然之美與生命力的展現，充滿滋養與溫暖。",
      "reversed": "警告過度依賴或過分慾望，可能帶來焦慮或阻礙創造力。逆位暗示需要恢復內在平衡。"
    },
    {
      "name": "The Emperor",
      "upright": "象徵秩序、穩定與權威。這張牌提醒你制定清晰計劃，並以自律與責任感實現目標。",
      "reversed": "暗示專制、缺乏控制或剝奪自由。逆位皇帝提醒注意過度控制或權力的不當使用。"
    },
    {
      "name": "The Hierophant",
      "upright": "代表傳統、信仰與教育。啟示你遵循傳統智慧，或在團體中尋求指引與支持。",
      "reversed": "象徵質疑權威或叛離傳統。逆位教皇可能意味需要打破過時的規範，追求個人真理。"
    },
    {
      "name": "The Chariot",
      "upright": "象徵勝利、意志力與控制。啟示透過堅定的決心克服障礙，掌控自己的命運。",
      "reversed": "警告方向迷失或自控力不足。逆位戰車可能提醒你需要重拾信心，避免過度執著。"
    },
    {
      "name": "Strength",
      "upright": "代表內在力量、勇氣與同情心。啟示以溫柔與耐心面對挑戰，掌控自己的情緒。",
      "reversed": "暗示懦弱、失控或缺乏信心。逆位提醒你尋求內心的力量，避免過度壓抑情緒。"
    },
    {
      "name": "The Hermit",
      "upright": "象徵內省與智慧。啟示通過孤獨尋求真理，關注內在的成長與啟發。",
      "reversed": "意味孤立或抗拒自我探索。逆位隱者提示過度封閉可能導致孤立，需與外界保持聯繫。"
    },
    {
      "name": "Wheel of Fortune",
      "upright": "代表命運的轉變與機會。提醒你接受生活中的循環變化，迎接命運帶來的挑戰與祝福。",
      "reversed": "暗示不穩定或受限的感覺。逆位提醒你不要過度抗拒變化，學會順應局勢。"
    },
    {
      "name": "Justice",
      "upright": "象徵公平、真相與因果。啟示你以誠實和正直行事，面對抉擇時秉持公正。",
      "reversed": "暗示偏見、不公平或責任逃避。逆位正義提醒要誠實面對後果，並糾正錯誤。"
    },
    {
      "name": "The Hanged Man",
      "upright": "代表靜觀其變與犧牲。啟示你從不同角度看待困境，放下執念以獲得啟發。",
      "reversed": "暗示停滯或缺乏進展。逆位吊人提醒你需要重新思考策略，避免浪費時間。"
    },
    {
      "name": "Death",
      "upright": "象徵結束與重生。啟示接受不可避免的改變，讓舊的結束為新的開始騰出空間。",
      "reversed": "暗示抗拒改變或害怕結束。逆位提醒你勇敢面對恐懼，迎接生命中的新篇章。"
    },
    {
      "name": "Temperance",
      "upright": "代表平衡、耐心與調和。提醒你採取中庸之道，穩步前進，達成和諧與穩定。",
      "reversed": "暗示極端、不耐煩或失衡。逆位節制提示你需放慢腳步，重新調整步伐。"
    },
    {
      "name": "The Devil",
      "upright": "象徵誘惑、束縛與陰影面。提醒你面對內心的弱點，避免被物質慾望或毒性關係控制。",
      "reversed": "暗示掙脫束縛或拒絕誘惑。逆位惡魔啟示突破限制，尋求自由與解脫。"
    },
    {
      "name": "The Tower",
      "upright": "代表突如其來的改變與動盪。啟示接受生活中的震撼，從危機中重建更堅固的基礎。",
      "reversed": "意味延遲的改變或拒絕接受事實。逆位提醒你不要逃避不可避免的變化。"
    },
    {
      "name": "The Star",
      "upright": "象徵希望、靈感與療癒。啟示你相信未來，並在內心找到希望的光芒。",
      "reversed": "暗示失望或缺乏信心。逆位星星提醒你需要重新點燃內在的希望之火。"
    },
    {
      "name": "The Moon",
      "upright": "代表潛意識、幻象與直覺。啟示你探索內心深處，接受不確定的真相。",
      "reversed": "意味迷惑、恐懼或真相浮現。逆位月亮提醒你警惕幻想，清晰面對現實。"
    },
    {
      "name": "The Sun",
      "upright": "象徵快樂、成功與光明未來。啟示你迎接幸福，並充分享受生命的美好。",
      "reversed": "暗示過度樂觀或自我中心。逆位太陽提醒保持謙虛，並珍惜身邊的支持。"
    },
    {
      "name": "Judgment",
      "upright": "代表覺醒、重生與抉擇。啟示你從過去的經驗中汲取教訓，迎接新的開始。",
      "reversed": "意味逃避責任或缺乏方向。逆位提醒你正視自己的選擇，並為未來負責。"
    },
    {
      "name": "The World",
      "upright": "象徵完成、成就與圓滿。啟示你完成一個旅程，並迎來豐碩成果的新階段。",
      "reversed": "暗示未完成或遺憾。逆位世界提醒你解決未竟之事，才能進入下一個階段。"
    }
  ]
}